# MetallicpaintFlecksColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MetallicPaint..::..MetallicpaintFlecksColor Property
MetallicPaint Class See Also
---
The property labeled "Color" from the "MetallicPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetallicpaintFlecksColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetallicpaintFlecksColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetallicpaintFlecksColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace